Tekla Open API Reference for Tekla Structures 2025
CannotPerformOperationDrawingEditorMustBeClosedException Class
 The CannotPerformOperationDrawingEditorMustBeClosedException class defines the exception that is thrown when a user tries to do an operation which requires the drawing editor to be closed.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotPerformOperationDrawingEditorMustBeClosedException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotPerformOperationDrawingEditorMustBeClosedException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotPerformOperationDrawingEditorMustBeClosedException
	Inherits TeklaStructuresDrawingsApplicationException
The CannotPerformOperationDrawingEditorMustBeClosedException type exposes the following members.
Constructors
Name | Description
CannotPerformOperationDrawingEditorMustBeClosedException
 Creates a new cannot perform operation drawing editor must be closed exception instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace